In [4]:
import pandas as pd

In [ ]:
data = pd.read_csv( 'datasets/kc_house_data.csv' )

# Primeiro contato com .groupby

In [10]:
# Quantos imoveis existem por numero de quartos
    # forma de fazer nao inteligente, ja que tem como ter tantos tipos distintos 
    # que nao vai ser possivel fazer isso
print(data[data[['bedrooms']]['bedrooms'] == 0].shape)
print(data[data[['bedrooms']]['bedrooms'] == 1].shape)
print(data[data[['bedrooms']]['bedrooms'] == 2].shape)
print(data[data[['bedrooms']]['bedrooms'] == 3].shape)
print(data[data[['bedrooms']]['bedrooms'] == 4].shape)

(13, 21)
(199, 21)
(2760, 21)
(9824, 21)
(6882, 21)

In [14]:
# esse metodo .goupby é para justamnente fazer o qeu estavamos querendo
 # contar quantos apartamentos tem em cada quantidade de quartos

data[['id','bedrooms']].groupby( 'bedrooms' ).size()

bedrooms
0       13
1      199
2     2760
3     9824
4     6882
5     1601
6      272
7       38
8       13
9        6
10       3
11       1
33       1
dtype: int64

In [21]:
df_grouped = data[['bedrooms']].groupby( 'bedrooms' )

In [22]:
# Como ir printando mais bonito na tela a nossas ideia acima

for bedrooms, frame in df_grouped :
    print( 'numero de quartos: {}'.format( bedrooms ) )
    print( frame.shape, end='\n\n' )

numero de quartos: 0
(13, 1)

numero de quartos: 1
(199, 1)

numero de quartos: 2
(2760, 1)

numero de quartos: 3
(9824, 1)

numero de quartos: 4
(6882, 1)

numero de quartos: 5
(1601, 1)

numero de quartos: 6
(272, 1)

numero de quartos: 7
(38, 1)

numero de quartos: 8
(13, 1)

numero de quartos: 9
(6, 1)

numero de quartos: 10
(3, 1)

numero de quartos: 11
(1, 1)

numero de quartos: 33
(1, 1)

In [ ]:
 for bedrooms, frame in df_grouped :
    print( 'numero de quartos: {}'.format( bedrooms ) )
    print( frame.head(4), end='\n\n' )

# Respondendo as perguntas do CEO

   ## Qual o numero de imoveis por ano de construçao?

In [26]:
# Sempre ter em mente duas coisas, quem é operador e quem é o filtro( nesse caso é o imoveis e ano de construçao ) )
data[['id','yr_built']].groupby( 'yr_built' ).count()

           id
yr_built
1900       87
1901       29
1902       27
1903       46
1904       45
...       ...
2011      130
2012      170
2013      201
2014      559
2015       38

[116 rows x 1 columns]

## Qual o menor numero de quartos por ano de construçao dos imoveis?

In [27]:
# Agora o operador é bedrooms e filtro é o ano denovo
data[['bedrooms','yr_built']].groupby( 'yr_built' ).min()

          bedrooms
yr_built
1900             1
1901             2
1902             2
1903             1
1904             2
...            ...
2011             1
2012             2
2013             2
2014             1
2015             1

[116 rows x 1 columns]

## Qual o preço de compra mais alto por cada numero de quarto?

In [28]:
data[['price','bedrooms']].groupby( 'bedrooms' ).max()

              price
bedrooms
0         1295650.0
1         1247000.0
2         3278000.0
3         3800000.0
4         4489000.0
5         7062500.0
6         7700000.0
7         3200000.0
8         3300000.0
9         1400000.0
10        1148000.0
11         520000.0
33         640000.0

## Qual a soma de todos os preços  de compra por numero de quartos?

In [33]:
pd.set_option('display.float_format', lambda x: '%.2f' % x)
data[['price','bedrooms']].groupby( 'bedrooms' ).sum()

                 price
bedrooms
0           5323550.00
1          63210934.00
2        1107788602.00
3        4580263939.00
4        4372957028.00
5        1259346326.00
6         224541613.00
7          36145017.00
8          14366000.00
9           5363999.00
10          2458000.00
11           520000.00
33           640000.00

## Qual a soma de todos os preços de compra por numero de quartos e banheiros?

In [35]:
data[['price','bedrooms','bathrooms']].groupby( ['bedrooms','bathrooms'] ).sum()

                        price
bedrooms bathrooms
0        0.00      3642600.00
         0.75       265000.00
         1.00       228000.00
         1.50       288000.00
         2.50       899950.00
...                       ...
10       2.00       650000.00
         3.00       660000.00
         5.25      1148000.00
11       3.00       520000.00
33       1.75       640000.00

[144 rows x 1 columns]

## Qual o tamanho medio das salas dos imoveis por ano de construçao?

In [37]:
data[['sqft_living','yr_built']].groupby( 'yr_built' ).mean()

          sqft_living
yr_built
1900          1732.01
1901          1763.62
1902          1919.63
1903          1507.74
1904          1603.18
...               ...
2011          2313.68
2012          2378.74
2013          2636.59
2014          2615.39
2015          2596.32

[116 rows x 1 columns]

## Qual o tamanho mediano(mediana) das salas dos imoveis por ano de construçao?

## Qual o desvio-padrao do tamanho das salas dos imoveis por ano de construçao( o quao meus dados estao espalhados da media )?

## Como é o crescimento medio de preços de compras dos imoveis, por ano, por dia, pela semana do ano?